STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_HAP_Peripheral/STM32_WPAN/App/app_ble.c
        case ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE:
        {
          aci_att_find_by_type_value_resp_event_rp0 *pr = (void*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE\n");

          if (bleAppContext.GattService.LinkupState == GATT_SERVICE_LINKUP_DISC_SERVICE && pr->Num_of_Handle_Pair == 1)
          {
            /* Retrieve Gatt Service Handles */
            bleAppContext.GattService.StartHandle = pr->Attribute_Group_Handle_Pair[0].Found_Attribute_Handle;
            bleAppContext.GattService.EndHandle = pr->Attribute_Group_Handle_Pair[0].Group_End_Handle;
          }

          break;
        }

        case ACI_GATT_DISC_READ_CHAR_BY_UUID_RESP_VSEVT_CODE:
        {
          aci_gatt_disc_read_char_by_uuid_resp_event_rp0 *pr = (void*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_GATT_DISC_READ_CHAR_BY_UUID_RESP_VSEVT_CODE\n");

          if (bleAppContext.GattService.LinkupState == GATT_SERVICE_LINKUP_DISC_CHAR)
          {
            /* Retrieve Service Changed Characteristic Handle */
            bleAppContext.GattService.ServiceChangedCharHandle = pr->Attribute_Handle;
          }
          break;
        }

        case ACI_ATT_FIND_INFO_RESP_VSEVT_CODE:
        {
          aci_att_find_info_resp_event_rp0 *pr = (void*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_ATT_FIND_INFO_RESP_VSEVT_CODE\n");

          if (bleAppContext.GattService.LinkupState == GATT_SERVICE_LINKUP_DISC_CHAR_DESC
              && pr->Event_Data_Length >= 4
                && (pr->Handle_UUID_Pair[2] + (pr->Handle_UUID_Pair[3] << 8) == SERVICE_CHANGED_CHARACTERISTIC_UUID))
          {
            /* Retrieve Service Changed Characteristic Descriptor Handle */
            bleAppContext.GattService.ServiceChangedCharDescHandle = pr->Handle_UUID_Pair[0] + (pr->Handle_UUID_Pair[1] << 8);
          }
          break;
        }

        case ACI_GATT_PROC_COMPLETE_VSEVT_CODE:
        {
          tBleStatus status;
          aci_gatt_proc_complete_event_rp0 *pr = (void*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_GATT_PROC_COMPLETE_VSEVT_CODE\n");

          if (pr->Connection_Handle == bleAppContext.ConnHandle
              && pr->Error_Code == BLE_STATUS_SUCCESS)
          {
            if (bleAppContext.GattService.LinkupState == GATT_SERVICE_LINKUP_DISC_SERVICE)
            {
              if (bleAppContext.GattService.StartHandle != 0)
              {
                const UUID_t uuid = { SERVICE_CHANGED_CHARACTERISTIC_UUID };
                /* Start Service Changed Characteristic Discovery */
                status = aci_gatt_disc_char_by_uuid(bleAppContext.ConnHandle,
                                                    bleAppContext.GattService.StartHandle,
                                                    bleAppContext.GattService.EndHandle,
                                                    0x01, &uuid);
                LOG_INFO_APP(">>== aci_gatt_disc_char_by_uuid with status %02X\n", status);

                if (status == BLE_STATUS_SUCCESS)
                {
                  bleAppContext.GattService.LinkupState = GATT_SERVICE_LINKUP_DISC_CHAR;
                }
                else
                {
                  HAPAPP_Linkup(bleAppContext.ConnHandle);
                }
              }
              else
              {
                /* No Gatt Service found */
                HAPAPP_Linkup(bleAppContext.ConnHandle);
              }
            }
            else if (bleAppContext.GattService.LinkupState == GATT_SERVICE_LINKUP_DISC_CHAR)
            {
              if (bleAppContext.GattService.ServiceChangedCharHandle != 0)
              {
                tBleStatus status;
                /* Start Service Changed Characteristic Descriptor */
                status  = aci_gatt_disc_all_char_desc(bleAppContext.ConnHandle,
                                                      bleAppContext.GattService.ServiceChangedCharHandle,
                                                      bleAppContext.GattService.EndHandle);
                LOG_INFO_APP(">>== aci_gatt_disc_all_char_desc with status %02X\n", status);

                if (status == BLE_STATUS_SUCCESS)
                {
                  bleAppContext.GattService.LinkupState = GATT_SERVICE_LINKUP_DISC_CHAR_DESC;
                }
                else
                {
                  /* No Service changed characteristic */
                  HAPAPP_Linkup(bleAppContext.ConnHandle);
                }
              }
              else
              {
                HAPAPP_Linkup(bleAppContext.ConnHandle);
              }
            }
            else if (bleAppContext.GattService.LinkupState == GATT_SERVICE_LINKUP_DISC_CHAR_DESC)
            {
              /* End of Gatt Service Linkup: Store database and start HAP App Linkup */
              if (bleAppContext.GattService.ServiceChangedCharDescHandle != 0)
              {
                bleAppContext.GattService.LinkupState = GATT_SERVICE_LINKUP_COMPLETE;
                GATTService_StoreDatabase();

                LOG_INFO_APP("Discovered GATT Service\n");
                LOG_INFO_APP("StartHandle=%04d\n", bleAppContext.GattService.StartHandle);
                LOG_INFO_APP("EndHandle=%04d\n", bleAppContext.GattService.EndHandle);
                LOG_INFO_APP("ServiceChangedCharHandle=%04d\n", bleAppContext.GattService.ServiceChangedCharHandle);
                LOG_INFO_APP("ServiceChangedCharDescHandle=%04d\n", bleAppContext.GattService.ServiceChangedCharDescHandle);
              }
              HAPAPP_Linkup(bleAppContext.ConnHandle);
            }
          }

          break;
        }
        /* USER CODE END ECODE_1 */
        default:
        {
          /* USER CODE BEGIN ECODE_DEFAULT */

          /* USER CODE END ECODE_DEFAULT */
          break;
        }
      }
      /* USER CODE BEGIN EVT_VENDOR_1 */

      /* USER CODE END EVT_VENDOR_1 */
    }
    break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */
    /* USER CODE BEGIN EVENT_PCKT */

