STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_HAP_Peripheral/STM32_WPAN/App/app_ble.c
static void GATTService_RestoreDatabase(void)
{
  tBleStatus status;
  uint8_t addr[6u];
  uint8_t temp_database[GATTSERVICE_GATT_DATABASE_SIZE] = {0};
  int res;
  uint8_t mode = NVM_FIRST;
  uint32_t hdr[BLENVM_GATTSERVICE_HDR_LEN / 4];

  /* Resolve address if address is random */
  if (bleAppContext.RemoteAddressType == 1u && ((bleAppContext.aRemoteAddress[5] & 0xC0U) == 0x40U))
  {
    status = aci_gap_resolve_private_addr( &bleAppContext.aRemoteAddress[0], &addr[0]);
    if (status != BLE_STATUS_SUCCESS)
    {
      return;
    }
  }
  else
  {
    MEMCPY(addr, bleAppContext.aRemoteAddress, 6u);
  }

  while (1)
  {
    /* Get the header part of each record in order to find if there is already in NVM some data corresponding
     * to the same remote device address
     */
    res = NVM_Get( mode, GATTSERVICE_NVM_TYPE,0, (uint8_t*)hdr, BLENVM_GATTSERVICE_HDR_LEN );
    mode = NVM_NEXT;
    if (res == NVM_EOF)
    {
      /* Reached EOF */
      break;
    }

    if (MEMCMP(&((uint8_t*)hdr)[1], addr, 6u) == 0)
    {
      /* Found Record */
      break;
    }
  }

  if (res != NVM_EOF)
  {
    (void) NVM_Get(0, GATTSERVICE_NVM_TYPE, BLENVM_GATTSERVICE_HDR_LEN, temp_database, GATTSERVICE_GATT_DATABASE_SIZE);

    bleAppContext.GattService.StartHandle = temp_database[0] + (temp_database[1] << 8);
    bleAppContext.GattService.EndHandle = temp_database[2] + (temp_database[3] << 8);
    bleAppContext.GattService.ServiceChangedCharHandle = temp_database[4] + (temp_database[5] << 8);
    bleAppContext.GattService.ServiceChangedCharDescHandle = temp_database[6] + (temp_database[7] << 8);

    LOG_INFO_APP("Restored GATT Service\n");
    LOG_INFO_APP("StartHandle=%04d\n", bleAppContext.GattService.StartHandle);
    LOG_INFO_APP("EndHandle=%04d\n", bleAppContext.GattService.EndHandle);
    LOG_INFO_APP("ServiceChangedCharHandle=%04d\n", bleAppContext.GattService.ServiceChangedCharHandle);
    LOG_INFO_APP("ServiceChangedCharDescHandle=%04d\n", bleAppContext.GattService.ServiceChangedCharDescHandle);

    bleAppContext.GattService.LinkupState = GATT_SERVICE_LINKUP_COMPLETE;
  }
}

/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

tBleStatus BLECB_Indication( const uint8_t* data,
                          uint16_t length,
                          const uint8_t* ext_data,
                          uint16_t ext_length )
{
  uint8_t status = BLE_STATUS_FAILED;
  BleEvtPacket_t *phcievt = NULL;
  uint16_t total_length = (length+ext_length);

  UNUSED(ext_data);

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    APP_BLE_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
    if (AMM_Alloc (CFG_AMM_VIRTUAL_APP_BLE,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   &APP_BLE_ResumeFlowProcessCb) != AMM_ERROR_OK)
    {
      LOG_INFO_APP("Alloc failed\n");
      status = BLE_STATUS_FAILED;
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      MEMCPY( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      UTIL_SEQ_SetTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SEQ_PRIO_0);
      status = BLE_STATUS_SUCCESS;
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
    status = BLE_STATUS_SUCCESS;
  }
  return status;
}

void NVMCB_Store( const uint32_t* ptr, uint32_t size )
{
  UNUSED(ptr);
  UNUSED(size);

  /* Call SNVMA for storing - Without callback */
  SNVMA_Write (APP_BLE_NvmBuffer,
               BLE_NvmCallback);
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
void APP_NotifyToRun( void )
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_AUDIO_ID, CFG_SEQ_PRIO_0);
  /* Requires to process Host Stack because in Audio Task, some API/HCI commands
   * could be called and so require to run Host Stack
   */
  BleStackCB_Process();
}
/* USER CODE END FD_WRAP_FUNCTIONS */
